/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ikawamuk <ikawamuk@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/03/25 21:27:54 by ikawamuk          #+#    #+#             */
/*   Updated: 2026/03/25 21:44:48 by ikawamuk         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

int	main(void)
{
	/*
	vector マージインサーションソートに向いてる。
	理由：ランダムアクセスがO(1)なので二分探索がO(log N)
	list マージインサーションソートに不適。
	理由：ランダムアクセスが出来ない。
	*/
	return (0);
}
